import { Link } from "react-router-dom"
import { IconNew } from "../../components/icon_news/IconNew"
import './index.css'

const Index = () => {
    const news = [
        {
            id: 1,
            urlImg: "https://media.slovoidilo.ua/media/publications/19/184138/184138-1_large.jpg",
            title: "У столиці рф вкотре пролунали вибухи, росЗМІ кажуть про нову атаку на Москва-сіті",
            body: "Про це повідомляють російські ЗМІ та новинні Telegram-канали. На опублікованих у соцмережах відео видно, що як мінімум один дрон влучив до однієї з веж «Москва-Сіті», біля неї видніється дим. Очевидці повідомляють про звук вибуху та потрапляння безпілотника у будівлю. Біля хмарочоса поліцейські перекрили рух, накопичується спеціальна техніка. Перед атакою безпілотників на «Москву-Сіті» дрони були помічені у кількох містах Підмосков'я. Повідомляється, що нібито один із дронів було знищено на підльоті до столиці країни-агресора, в районі Кубинки.«Кілька безпілотників під час спроби прольоту до Москви були збиті засобами ППО. Один долетів до тієї ж вежі в «Сіті», що й минулого разу. Пошкоджено фасад на рівні 21 поверху. Екстрені служби працюють на місці події», - заявив мер міста Сергій Собянін.",
            urlNew: "https://www.slovoidilo.ua/2023/08/01/novyna/svit/stolyczi-rf-vkotre-prolunaly-vybuxy-roszmi-kazhut-pro-novu-ataku-moskva-siti"
        },

        {
            id: 2,
            urlImg: "https://media.slovoidilo.ua/media/publications/19/184138/184138-1_large.jpg",
            title: "У столиці рф вкотре пролунали вибухи, росЗМІ кажуть про нову атаку на Москва-сіті",
            body: "Про це повідомляють російські ЗМІ та новинні Telegram-канали. На опублікованих у соцмережах відео видно, що як мінімум один дрон влучив до однієї з веж «Москва-Сіті», біля неї видніється дим. Очевидці повідомляють про звук вибуху та потрапляння безпілотника у будівлю. Біля хмарочоса поліцейські перекрили рух, накопичується спеціальна техніка. Перед атакою безпілотників на «Москву-Сіті» дрони були помічені у кількох містах Підмосков'я. Повідомляється, що нібито один із дронів було знищено на підльоті до столиці країни-агресора, в районі Кубинки.«Кілька безпілотників під час спроби прольоту до Москви були збиті засобами ППО. Один долетів до тієї ж вежі в «Сіті», що й минулого разу. Пошкоджено фасад на рівні 21 поверху. Екстрені служби працюють на місці події», - заявив мер міста Сергій Собянін.",
            urlNew: "https://www.slovoidilo.ua/2023/08/01/novyna/svit/stolyczi-rf-vkotre-prolunaly-vybuxy-roszmi-kazhut-pro-novu-ataku-moskva-siti"
        },

        {
            id: 3,
            urlImg: "https://media.slovoidilo.ua/media/publications/19/184138/184138-1_large.jpg",
            title: "У столиці рф вкотре пролунали вибухи, росЗМІ кажуть про нову атаку на Москва-сіті",
            body: "Про це повідомляють російські ЗМІ та новинні Telegram-канали. На опублікованих у соцмережах відео видно, що як мінімум один дрон влучив до однієї з веж «Москва-Сіті», біля неї видніється дим. Очевидці повідомляють про звук вибуху та потрапляння безпілотника у будівлю. Біля хмарочоса поліцейські перекрили рух, накопичується спеціальна техніка. Перед атакою безпілотників на «Москву-Сіті» дрони були помічені у кількох містах Підмосков'я. Повідомляється, що нібито один із дронів було знищено на підльоті до столиці країни-агресора, в районі Кубинки.«Кілька безпілотників під час спроби прольоту до Москви були збиті засобами ППО. Один долетів до тієї ж вежі в «Сіті», що й минулого разу. Пошкоджено фасад на рівні 21 поверху. Екстрені служби працюють на місці події», - заявив мер міста Сергій Собянін.",
            urlNew: "https://www.slovoidilo.ua/2023/08/01/novyna/svit/stolyczi-rf-vkotre-prolunaly-vybuxy-roszmi-kazhut-pro-novu-ataku-moskva-siti"
        },

        {
            id: 4,
            urlImg: "https://media.slovoidilo.ua/media/publications/19/184138/184138-1_large.jpg",
            title: "У столиці рф вкотре пролунали вибухи, росЗМІ кажуть про нову атаку на Москва-сіті",
            body: "Про це повідомляють російські ЗМІ та новинні Telegram-канали. На опублікованих у соцмережах відео видно, що як мінімум один дрон влучив до однієї з веж «Москва-Сіті», біля неї видніється дим. Очевидці повідомляють про звук вибуху та потрапляння безпілотника у будівлю. Біля хмарочоса поліцейські перекрили рух, накопичується спеціальна техніка. Перед атакою безпілотників на «Москву-Сіті» дрони були помічені у кількох містах Підмосков'я. Повідомляється, що нібито один із дронів було знищено на підльоті до столиці країни-агресора, в районі Кубинки.«Кілька безпілотників під час спроби прольоту до Москви були збиті засобами ППО. Один долетів до тієї ж вежі в «Сіті», що й минулого разу. Пошкоджено фасад на рівні 21 поверху. Екстрені служби працюють на місці події», - заявив мер міста Сергій Собянін.",
            urlNew: "https://www.slovoidilo.ua/2023/08/01/novyna/svit/stolyczi-rf-vkotre-prolunaly-vybuxy-roszmi-kazhut-pro-novu-ataku-moskva-siti"
        }
    ]

    return (
        <div className="index">
            {news.map(item =>
                <Link key={item.id} to={`/articles/${item.id}`}>
                    <IconNew
                        curentNew={item}
                        width={'100%'}  
                    />
                </Link>
            )
            }
        </div>
    )
}

export { Index }